[
  {
    "id": "macritchie",
    "name": "MacRitchie Reservoir",
    "overview": "Singapore's oldest reservoir, MacRitchie is a playground for nature lovers and exercise enthusiasts. It anchors the Central Catchment Nature Reserve and is known for its hiking trails, pontoon bridge, and the TreeTop Walk.",
    "difficulty": "Moderate",
    "duration": "2-4 hours",
    "amenities": [
      "Restrooms",
      "Water Coolers",
      "Cafe",
      "Kayak Rental",
      "Parking"
    ],
    "transport": "Bus 132, 165, 166, 167, 855, 980 to Lornie Road",
    "scenic": [
      "HSBC TreeTop Walk - A 250m one-way suspension bridge through the rainforest canopy with panoramic views.",
      "Jelutong Tower - A 7-deck observation tower offering a view of the forest canopy.",
      "Chemperai Boardwalk - Scenic boardwalk skirting the edge of the reservoir with easy waterside walking."
    ],
    "mapUrl": "https://maps.app.goo.gl/MacRitchieReservoir",
    "hours": "7:00 AM - 7:00 PM daily (TreeTop Walk closed Mondays)",
    "coordinates": {
      "lat": 1.3436,
      "lng": 103.8311
    },
    "image": "/images/macritchie.png"
  },
  {
    "id": "bukittimah",
    "name": "Bukit Timah Nature Reserve",
    "overview": "Home to Singapore's highest hill, this reserve contains one of the few areas of primary rainforest left in the country. It offers challenging trails and a rich diversity of flora and fauna.",
    "difficulty": "Hard",
    "duration": "1-3 hours",
    "amenities": [
      "Visitor Center",
      "Restrooms",
      "Vending Machines"
    ],
    "transport": "Beauty World MRT (DT5), Exit A",
    "scenic": [
      "Bukit Timah Hill Summit - Singapore’s highest natural peak at about 163 m, reached via several steep forest trails.",
      "Hindhede Quarry - Family-friendly loop with a dramatic cliff-and-lake viewpoint right beside the visitor centre.",
      "Primary Rainforest - One of Singapore’s last patches of primary rainforest, rich in dipterocarp trees and native wildlife."
    ],
    "mapUrl": "https://maps.app.goo.gl/BukitTimahNatureReserve",
    "hours": "7:00 AM - 7:00 PM daily",
    "coordinates": {
      "lat": 1.3541,
      "lng": 103.7769
    },
    "image": "/images/bukit_timah.jpg"
  },
  {
    "id": "railcorridor",
    "name": "Rail Corridor",
    "overview": "A former railway line transformed into a continuous green passage that runs through the island. It's a popular spot for walking, running, and cycling, connecting various green spaces.",
    "difficulty": "Easy",
    "duration": "2-5 hours",
    "amenities": [
      "Restrooms (at access points)",
      "Shelters"
    ],
    "transport": "King Albert Park MRT (DT6) or Hillview MRT (DT3)",
    "scenic": [
      "Historic Truss Bridges - Iconic steel truss railway bridge over Bukit Timah and Dunearn Roads, a classic photo spot.",
      "Bukit Timah Railway Station - Conserved heritage station buildings serving as a key access point.",
      "Clementi Forest - View of the misty jungle from the corridor."
    ],
    "mapUrl": "https://maps.app.goo.gl/RailCorridor",
    "hours": "Open 24/7 (Not lit at night, leave before dark recommended)",
    "coordinates": {
      "lat": 1.3343,
      "lng": 103.7811
    },
    "image": "/images/rail_corridor.png"
  },
  {
    "id": "coneyisland",
    "name": "Coney Island",
    "overview": "A rustic, ecologically sustainable park with a wide variety of habitats, including coastal forests, grasslands, mangroves, and casuarina woodlands. It's great for cycling and bird watching.",
    "difficulty": "Easy",
    "duration": "1-2 hours",
    "amenities": [
      "Restrooms",
      "Shelters"
    ],
    "transport": "Punggol Point LRT (PW3), then walk 500m",
    "scenic": [
      "Coastal Trails - Rustic trails and quiet beaches along the Johor Strait.",
      "Casuarina Woodlands - Groves that support diverse birds and wildlife in a wild-feeling setting.",
      "Haw Par Beach Villa - Atmospheric remains of old structures viewable from the paths."
    ],
    "mapUrl": "https://maps.app.goo.gl/ConeyIsland",
    "hours": "7:00 AM - 7:00 PM daily (Gates close at 7 PM)",
    "coordinates": {
      "lat": 1.3461,
      "lng": 103.8778
    },
    "image": "/images/coney_island.png"
  },
  {
    "id": "sungeibuloh",
    "name": "Sungei Buloh Wetland Reserve",
    "overview": "Singapore's first ASEAN Heritage Park, this wetland reserve is a haven for migratory birds and mangrove wildlife. It features boardwalks through mangroves and mudflats.",
    "difficulty": "Easy",
    "duration": "2-3 hours",
    "amenities": [
      "Visitor Center",
      "Restrooms",
      "Cafe",
      "Observation Hides"
    ],
    "transport": "Kranji MRT (NS7), then Bus 925",
    "scenic": [
      "Migratory Bird Paradise - 231 recorded bird species including whimbrels, plovers, and white-bellied sea eagles.",
      "Eagle Point - Coastal observation area perfect for sunrise viewing and spotting white-bellied sea eagles.",
      "Crocodile & Monitor Habitat - Only place in Singapore where saltwater crocodiles can be spotted in their natural habitat."
    ],
    "mapUrl": "https://maps.app.goo.gl/SungeiBuloh",
    "hours": "7:00 AM - 7:00 PM daily (Last entry 6:30 PM)",
    "coordinates": {
      "lat": 1.4396,
      "lng": 103.7351
    },
    "image": "/images/sungei_buloh.jpg"
  },
  {
    "id": "labrador",
    "name": "Labrador Nature Reserve",
    "overview": "A park that offers a unique blend of nature and history. It features the only rocky sea-cliff on the mainland and World War II relics like tunnels and a fort.",
    "difficulty": "Easy",
    "duration": "1-2 hours",
    "amenities": [
      "Restrooms",
      "Playground",
      "Fitness Stations"
    ],
    "transport": "Labrador Park MRT (CC27)",
    "scenic": [
      "Rocky Sea-Cliff - Singapore's unique coastal geological feature offering tide pool exploration.",
      "World War II Heritage Sites - Historic British Fort Pasir Panjang relics, bunkers, and artillery monuments.",
      "Berlayer Creek Mangrove Trail - Scenic 2.1-km coastal boardwalk through pristine mangrove forest."
    ],
    "mapUrl": "https://maps.app.goo.gl/LabradorPark",
    "hours": "Nature Reserve: 7:00 AM - 7:00 PM | Park areas: Open 24 hours",
    "coordinates": {
      "lat": 1.2644,
      "lng": 103.8045
    },
    "image": "/images/labrador.jpg"
  }
]